{
  "reasoning.predict": {
    "traces": [],
    "train": [],
    "demos": [],
    "signature": {
      "instructions": "### Instructions for ESG Document Analysis and Question Answering\n\n**Task Description:**\n- **Objective:** Analyze the context from an ESG (Environmental, Social, and Governance) document to answer specific questions.\n- **Stages:** The task involves a two-stage extraction process:\n  - **Stage 1:** Generate a chain-of-thought analysis over the retrieved context to answer ESG questions.\n  - **Stage 2:** Provide a detailed reasoning and final answer based on the analysis.\n\n**Input Format:**\n- **Question:** A specific question related to the ESG document.\n- **Context:** Extracts from the ESG document, each with a page number and relevance score.\n- **doc_id:** The ID or name of the document.\n\n**Output Format:**\n- **reasoning:** A detailed explanation of your thought process and how you arrived at the answer.\n- **analysis:** A clear and concise summary of the key points from the context that support your answer.\n- **answer:** The final answer to the question. The answer should be one of the following types:\n  - **Str (String):** For answers that are in text form.\n  - **Float:** For answers that are numeric values, especially when precision is required.\n  - **None:** If the context does not contain sufficient information to answer the question, clearly state that the question cannot be answered from the given context.\n\n**Important Notes:**\n- Ensure that the answer type matches the expected format (e.g., Str for text, Float for numbers, None for unanswerable questions).\n- Be precise in extracting numeric values and verify the units and decimal places.\n- Pay special attention to the units and format of the answer, especially when dealing with percentages, monetary values, and other specific metrics.\n\n**General Strategy:**\n- Carefully read and understand the context provided.\n- Identify the relevant information that directly addresses the question.\n- If the context does not provide enough information, clearly state that the question cannot be answered.\n- Ensure that the answer type (Str, Float, or None) matches the expected format.\n- Be precise in extracting and verifying numeric values, especially when dealing with units and decimal places.\n\n**Niche and Domain-Specific Factual Information:**\n- **SA8000 Clauses:**\n  - **Clause 8.1:** The organization must ensure that wages for a normal work week, not including overtime, meet at least legal or industry minimum standards, or collective bargaining agreements. Wages should be sufficient to meet the basic needs of personnel and provide some discretionary income.\n  - **Clause 8.4:** Overtime/premium rate requirements. Senior management who have a significant role in setting their own work schedules and a base remuneration that significantly exceeds the living wage may not be subject to SA8000 8.4 overtime/premium rate requirements.\n  - **Clause 8.5:** Prohibits labor practices that reduce workers’ wages or benefits or result in a precarious employment situation for a worker, such as certain contract and apprenticeship schemes.\n- **Chief Sustainability Officer (CSO) Responsibilities:**\n  - Managing annual budgets for climate mitigation activities.\n  - Managing major capital and/or operational expenditures related to low-carbon products or services (including R&D).\n  - Managing climate-related acquisitions, mergers, and divestitures.\n  - Developing a climate transition plan.\n- **Global STEM Graduates:**\n  - On average, only 35% of STEM graduates are women globally, as of 2018–23.\n  - The total number of STEM graduates globally is not provided, making it impossible to calculate the exact number of women who graduated with a STEM degree in 2022.\n\n**Example Scenarios:**\n\n**Example 1:**\n- **Question:** If a worker needs to earn a living wage without working overtime, but company wages are below living cost, which SA8000 clauses are breached?\n- **Context:**\n  - [Page 85, score: 0.794] \"Legal and other requirements. Where permitted by law, senior management who have a significant role in setting their own work schedules and a base remuneration that significantly exceeds the living wage may not be subject to SA8000 8.4 overtime/premium rate requirements. Lastly, SA8000 8.5 is intended to specifically prohibit labour practices that reduce workers’ wages or benefits or result in a precarious employment situation for a worker, such as certain contract and apprenticeship schemes.\"\n  - [Page 84, score: 0.787] \"Forcing workers to work excessive overtime in order to earn enough to meet basic needs. INTENT OF THE STANDARD This requirement of SA8000 is intended to ensure that all workers at a SA8000 certified organisation are paid a living wage. As a basis, it also requires that the wage for a normal workweek (not inclusive of overtime) to meet at least legal or industry minimum standards, or wage rates stipulated in a collective bargaining agreement. As noted\"\n- **Analysis:**\n  - The context explicitly states that if wages are below the living cost, the organization would be failing to meet the requirements set out in Clause 8.1 and Clause 8.4.\n- **Answer:** 8.1, 8.4\n\n**Example 2:**\n- **Question:** What are the key responsibilities of the Chief Sustainability Officer?\n- **Context:**\n  - [Page 4, score: 0.767] \"C1.2 (C1.2) Provide the highest management-level position(s) or committee(s) with responsibility for climate-related issues. Position or committee Chief Sustainability Officer (CSO) Climate-related responsibilities of this position Managing annual budgets for climate mitigation activities Managing major capital and/or operational expenditures related to low-carbon products or services (including R&D) Managing climate-related acquisitions, mergers, and divestitures Developing a climate transition plan\"\n- **Analysis:**\n  - The context provides detailed information about the CSO's responsibilities, including managing budgets, expenditures, acquisitions, and developing a climate transition plan.\n- **Answer:** Managing annual budgets for climate mitigation activities, managing major capital and/or operational expenditures related to low-carbon products or services (including R&D), managing climate-related acquisitions, mergers, and divestitures, developing a climate transition plan\n\n**Example 3:**\n- **Question:** What was the number of women who graduated with a STEM degree globally in 2022?\n- **Context:**\n  - [Page 52, score: 0.767] \"FIGURE 23: On average, only 35% of STEM graduates are women Share of female STEM graduates, selected countries, 2022 or most recent year 0 10 20 30 40 50 60 70 Niger Chad Ghana Burkina Faso Lesotho Burundi Mozambique Benin Rwanda Seychelles Mauritania Madagascar Botswana Mauritius Namibia Cabo Verde South Africa U. R. Tanzania Belarus Ukraine Germany Austria Rep. Moldova Luxembourg France Canada Montenegro Bosnia/Herzeg. Afghanistan Bangladesh Uzbekistan Kazakhstan Maldives Turkmenistan Sri Lanka\"\n  - [Page 52, score: 0.748] \"In Italy, half of the gender gap in tertiary STEM graduation is attributed to gender differences in the mathematics and science content of the respective secondary school curricula (Granato, 2023). Globally, women are considerably less likely to choose STEM fields. In 2018–23, the share of STEM graduates who were female was 35% (Figure 23). In 12 out of 122 countries, at most one in four graduates were female. Of those, five were\"\n- **Analysis:**\n  - The context provides the global share of female STEM graduates as 35%, but the total number of STEM graduates globally is not provided, making it impossible to calculate the exact number of women who graduated with a STEM degree in 2022.\n- **Answer:** Not answerable\n\nBy following these instructions, you will be able to provide accurate and well-reasoned answers to ESG-related questions.",
      "fields": [
        {
          "prefix": "Context:",
          "description": "Retrieved chunks from ESG documents"
        },
        {
          "prefix": "Question:",
          "description": "ESG question to answer"
        },
        {
          "prefix": "Doc Id:",
          "description": "Source document identifier"
        },
        {
          "prefix": "Reasoning: Let's think step by step in order to",
          "description": "${reasoning}"
        },
        {
          "prefix": "Analysis:",
          "description": "Detailed chain-of-thought reasoning analyzing the context to answer the question. If context lacks sufficient information, clearly state the question cannot be answered."
        }
      ]
    },
    "lm": null
  },
  "extraction": {
    "traces": [],
    "train": [],
    "demos": [],
    "signature": {
      "instructions": "Extract structured answer from analysis.\n\nStage 2 of two-stage extraction: Extract final answer in specified format\n(Int, Float, Str, List) from the chain-of-thought analysis.\n\nCRITICAL INSTRUCTIONS:\n- Extract answer in the specified format: Int, Float, Str, or List\n- If the analysis indicates the question cannot be answered from the context,\n  respond with exactly: \"Not answerable\"\n- If the analysis indicates it cannot read/understand images or documents,\n  respond with exactly: \"Fail to answer\"\n- Otherwise, provide only the answer value without explanation",
      "fields": [
        {
          "prefix": "Question:",
          "description": "Original ESG question"
        },
        {
          "prefix": "Analysis:",
          "description": "Chain-of-thought reasoning from Stage 1"
        },
        {
          "prefix": "Answer Format:",
          "description": "Required answer format: Int, Float, Str, or List"
        },
        {
          "prefix": "Extracted Answer:",
          "description": "Final answer in specified format, or \"Not answerable\" if context lacks information, or \"Fail to answer\" if documents cannot be read"
        }
      ]
    },
    "lm": null
  },
  "metadata": {
    "dependency_versions": {
      "python": "3.10",
      "dspy": "3.0.3",
      "cloudpickle": "3.1"
    }
  }
}
